location = {
    '가수원네거리': {
        'id': 'CCTV08'
    },
    '가장교오거리': {
        'id': 'CCTV14'
    },
    '가장네거리': {
        'id': 'CCTV16'
    },
    '갑천대교네거리': {
        'id': 'CCTV40'
    },
    '계룡대교네거리': {
        'id': 'CCTV70'
    },
    '과학공원네거리': {
        'id': 'CCTV22'
    },
    '과학공원네거리_교차로': {
        'id': 'CCTV77'
    },
    '관저네거리': {
        'id': 'CCTV68'
    },
    '궁동네거리': {
        'id': 'CCTV41'
    },
    '금성골네거리': {
        'id': 'CCTV76'
    },
    '남선공원네거리': {
        'id': 'CCTV48'
    },
    '농수산시장오거리': {
        'id': 'CCTV38'
    },
    '대고오거리': {
        'id': 'CCTV28'
    },
    '대동역오거리': {
        'id': 'CCTV35'
    },
    '대성삼거리': {
        'id': 'CCTV30'
    },
    '대전역네거리': {
        'id': 'CCTV01'
    },
    '대전일보네거리': {
        'id': 'CCTV63'
    },
    '대종로네거리': {
        'id': 'CCTV31'
    },
    '대화JC': {
        'id': 'CCTV52'
    },
    '대화영업소': {
        'id': 'CCTV53'
    },
    '덕명네거리': {
        'id': 'CCTV62'
    },
    '도룡삼거리': {
        'id': 'CCTV65'
    },
    '도마네거리': {
        'id': 'CCTV06'
    },
    '도안네거리': {
        'id': 'CCTV71'
    },
    '도안중네거리': {
        'id': 'CCTV73'
    },
    '동부네거리': {
        'id': 'CCTV09'
    },
    '만년네거리': {
        'id': 'CCTV21'
    },
    '모정네거리': {
        'id': 'CCTV39'
    },
    '변동오거리': {
        'id': 'CCTV17'
    },
    '보문산공원오거리': {
        'id': 'CCTV57'
    },
    '부사오거리': {
        'id': 'CCTV29'
    },
    '북대전IC네거리': {
        'id': 'CCTV58'
    },
    '불티구름다리': {
        'id': 'CCTV07'
    },
    '삼성네거리': {
        'id': 'CCTV33'
    },
    '삼성동성당네거리': {
        'id': 'CCTV11'
    },
    '삼천교네거리': {
        'id': 'CCTV49'
    },
    '상서삼거리': {
        'id': 'CCTV59'
    },
    '서대전네거리': {
        'id': 'CCTV05'
    },
    '선사유적네거리': {
        'id': 'CCTV20'
    },
    '성남네거리': {
        'id': 'CCTV32'
    },
    '성모병원오거리': {
        'id': 'CCTV27'
    },
    '시청역네거리': {
        'id': 'CCTV56'
    },
    '신구교네거리': {
        'id': 'CCTV24'
    },
    '신탄진네거리': {
        'id': 'CCTV25'
    },
    '안골네거리': {
        'id': 'CCTV18'
    },
    '엑스포지하차도': {
        'id': 'CCTV51'
    },
    '예술가의집네거리': {
        'id': 'CCTV04'
    },
    '오룡역네거리': {
        'id': 'CCTV13'
    },
    '오정네거리': {
        'id': 'CCTV37'
    },
    '오정동주민센터5가': {
        'id': 'CCTV67'
    },
    '옥녀봉네거리': {
        'id': 'CCTV72'
    },
    '용문역네거리': {
        'id': 'CCTV47'
    },
    '용전네거리': {
        'id': 'CCTV10'
    },
    '원골네거리': {
        'id': 'CCTV75'
    },
    '원동네거리': {
        'id': 'CCTV34'
    },
    '원신흥삼거리': {
        'id': 'CCTV74'
    },
    '원촌네거리': {
        'id': 'CCTV45'
    },
    '월드컵경기장네거리': {
        'id': 'CCTV42'
    },
    '유성IC삼거리': {
        'id': 'CCTV43'
    },
    '유성네거리': {
        'id': 'CCTV44'
    },
    '유성생명고교삼거리': {
        'id': 'CCTV69'
    },
    '읍내삼거리': {
        'id': 'CCTV46'
    },
    '중구청네거리': {
        'id': 'CCTV03'
    },
    '중리네거리': {
        'id': 'CCTV36'
    },
    '중앙로역네거리': {
        'id': 'CCTV02'
    },
    '중촌네거리': {
        'id': 'CCTV12'
    },
    '진잠네거리': {
        'id': 'CCTV60'
    },
    '충대병원네거리': {
        'id': 'CCTV26'
    },
    '충대오거리': {
        'id': 'CCTV61'
    },
    '침신대네거리': {
        'id': 'CCTV55'
    },
    '큰마을네거리': {
        'id': 'CCTV19'
    },
    '태평오거리': {
        'id': 'CCTV14'
    },
    '판암1동주민센터네거리': {
        'id': 'CCTV64'
    },
    '평송수련원삼거리': {
        'id': 'CCTV50'
    },
    '한남5가': {
        'id': 'CCTV66'
    },
    '한밭영업소': {
        'id': 'CCTV54'
    },
    '화암네거리': {
        'id': 'CCTV23'
    }
}


def get_full_loc():
    return list(location.keys())

def get_id(name):
    return location[name]
